{
  "previousSessions": [
    {
      "id": "s1",
      "name": "Week 1 Warmup",
      "date": "2025-05-20",
      "notes": "Focus on warmup exercises ",
      "activities": [
        {
          "id": "1_session_example_s1_1",
          "name": "Catch Me If You Can",
          "duration": "00:30",
          "description": "Players pair up with one ball between them. The player without the ball starts running while the player with the ball counts to 3, then dribbles to try and catch their partner. Switch roles after each round. Focuses on acceleration, change of direction, and dribbling speed.",
          "img_url": "",
          "originalTemplateId": "1"
        },
        {
          "id": "4_session_example_s1_2",
          "name": "Dynamic Soccer Warm Up",
          "duration": "01:00",
          "description": "Progressive warm-up routine including jogging, high knees, butt kicks, side shuffles, karaoke steps, dynamic stretching, and light ball work. Set up in lanes 15-20 yards long. Ensure all major muscle groups are activated. Finish with short passing sequences to transition into technical work.",
          "img_url": "",
          "originalTemplateId": "4"
        },
        {
          "id": "2_session_example_s1_3",
          "name": "Circle Passing",
          "duration": "00:45",
          "description": "Players form a circle with 1-2 players in the middle. Outer players pass the ball around while inside players try to intercept. If successful, the player who lost the ball switches to the middle. Focus on quick, accurate passing and communication. Increase difficulty by adding a second ball.",
          "img_url": "",
          "originalTemplateId": "2"
        }
      ]
    },
    {
      "id": "s2",
      "name": "Practice session",
      "date": "2025-04-15",
      "notes": "Regular practice",
      "activities": [
        {
          "id": "5_session_example_s2_1",
          "name": "1-on-1 Gate Dribbling",
          "duration": "01:00",
          "description": "Set up multiple 'gates' (two cones 1-2 yards apart) throughout the playing area. Players pair up, with one attacker and one defender. Attackers score by dribbling through as many gates as possible in 60 seconds while defenders try to win the ball. Switch roles and compare scores. Develops close control and shielding.",
          "img_url": "",
          "originalTemplateId": "5"
        },
        {
          "id": "3_session_example_s2_2",
          "name": "Dribbling Commands",
          "duration": "00:30",
          "description": "Players dribble freely in a marked area. Coach calls out commands like 'stop', 'change direction', 'use left foot only', 'outside of foot only', etc. Players must immediately respond while maintaining ball control. Great for developing listening skills and technical ability under pressure.",
          "img_url": "",
          "originalTemplateId": "3"
        },
        {
          "id": "7_session_example_s2_3",
          "name": "Dribble Attack",
          "duration": "01:00",
          "description": "Create a 30x20 yard grid with goals at each end. Divide players into attackers and defenders. Attackers start with the ball and must dribble past defenders to score in the opposite goal. Defenders can only win the ball in their defensive half. If successful, they transition to attack. Emphasizes 1v1 attacking moves and finishing.",
          "img_url": "",
          "originalTemplateId": "7"
        }
      ]
    }
  ]
}
